In [207]:
# Linear algebra and data manipulation imports
import pandas as pd
import numpy  as np

In [208]:
DATA_DIR='../data/'

# Import cleansed train data and test data
train = pd.read_csv(DATA_DIR + 'clean_titanic_train.csv')
test = pd.read_csv(DATA_DIR + 'clean_titanic_test.csv')

In [209]:
# Check first five rows of clean train data set
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,Mr

In [210]:
# Check info of clean train dataset
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
 11  Title        891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [211]:
# Check shape of clean train dataset
train.shape

(891, 12)

In [212]:
# Show description of clean train dataset
train.describe()

# Note that Pclass' shown is a categorical variable

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.292875,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.210527,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,37.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [213]:
# Check the first five rows of the clean test data
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,Mrs

In [214]:
# Check the dimensions (row count) of the clean test data
test.shape

(418, 11)

In [215]:
# Show the description of the clean test data, excluding non-numeric columns
test.describe()

# Note that Pclass' shown is a categorical variable

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  418.000000  418.000000  418.000000  418.000000
mean   1100.500000    2.265550   29.408289    0.447368    0.392344   35.570249
std     120.810458    0.841838   12.964896    0.896760    0.981429   55.852634
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   23.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   25.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   36.375000    1.000000    0.000000   31.471875
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [216]:
# remove columns that won't be part of the model
train.drop(['PassengerId', 'Name', 'Ticket'], axis=1, inplace=True);

###### Dummy variable - dealing with categorical variables

Note that *Pclass*, *Sex* and *Embarked* are categorical variables. So we need dummy variables to represent each category using one-hot encoding and avoiding full correlation between the correlations (a category is omitted to prevent full correlation)

**Representations**

*PClass*: 'Pclass_1' represents First Class, 'Pclass_2' represents Second Class and 'Pclass_3' represents Third Class

*Sex*: 'Sex_male' represents Male and 'Sex_female' represents Female

*Embarked*: 'Embarked_C' represents Cherbourg or 'C', 'Embarked_S' represents Southampton or 'S' and 'Embarked_Q' represents Queenstown or 'Q'

In [217]:
from sklearn.preprocessing import OneHotEncoder
columns = ['Sex', 'Pclass', 'Embarked', 'Title']
drop_columns = ['Sex_female', 'Pclass_1', 'Embarked_C', 'Title_Dona']
ohe= OneHotEncoder(handle_unknown='ignore', sparse=False, dtype=np.int64)
ohe.fit(train[columns])

part_encoded = ohe.transform(train[columns])
columns_encoded = ohe.get_feature_names(columns)
part_encoded_df = pd.DataFrame(part_encoded,columns=columns_encoded,index=train.index)

train.drop(columns, axis=1,inplace=True)
part_encoded_df.drop(drop_columns,axis=1,inplace=True,errors='ignore')

train_encoded = pd.concat([train, part_encoded_df], axis='columns')

In [218]:
train_encoded.head()

,Survived,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S,...,Title_Master,Title_Miss,Title_Mlle,Title_Mme,Title_Mr,Title_Mrs,Title_Ms,Title_Rev,Title_Sir,Title_the Countess
0,0,22.0,1,0,7.2500,1,0,1,0,1,...,0,0,0,0,1,0,0,0,0,0
1,1,38.0,1,0,71.2833,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,1,26.0,0,0,7.9250,0,0,1,0,1,...,0,1,0,0,0,0,0,0,0,0
3,1,35.0,1,0,53.1000,0,0,0,0,1,...,0,0,0,0,0,1,0,0,0,0
4,0,35.0,0,0,8.0500,1,0,1,0,1,...,0,0,0,0,1,0,0,0,0,0

In [219]:
# save transformed train data to csv file
train_encoded.to_csv(DATA_DIR + 'encoded_titanic_train.csv',index=False)

##### Transforming the test data categorical variables

In [220]:
# remove columns that won't be part of the model
test.drop(['PassengerId', 'Name', 'Ticket'], axis=1, inplace=True);

TypeError: 'Series' objects are mutable, thus they cannot be hashed

In [221]:
part_encoded = ohe.transform(test[columns])
columns_encoded = ohe.get_feature_names(columns)
part_encoded_df = pd.DataFrame(part_encoded,columns=columns_encoded,index=test.index)


test.drop(columns, axis=1,inplace=True,errors='ignore')
part_encoded_df.drop(drop_columns,axis=1,inplace=True,errors='ignore')

test_encoded = pd.concat([test, part_encoded_df], axis='columns')

In [222]:
test_encoded.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S,Title_Capt,...,Title_Master,Title_Miss,Title_Mlle,Title_Mme,Title_Mr,Title_Mrs,Title_Ms,Title_Rev,Title_Sir,Title_the Countess
0,34.5,0,0,7.8292,1,0,1,1,0,0,...,0,0,0,0,1,0,0,0,0,0
1,47.0,1,0,7.0000,0,0,1,0,1,0,...,0,0,0,0,0,1,0,0,0,0
2,62.0,0,0,9.6875,1,1,0,1,0,0,...,0,0,0,0,1,0,0,0,0,0
3,27.0,0,0,8.6625,1,0,1,0,1,0,...,0,0,0,0,1,0,0,0,0,0
4,22.0,1,1,12.2875,0,0,1,0,1,0,...,0,0,0,0,0,1,0,0,0,0

In [223]:
# save transformed test data to csv file

test_encoded.to_csv(DATA_DIR + 'encoded_titanic_test.csv',index=False)